W7D2/MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "rlYNn4tNknf3XPSRWHrmpA"], ["updated_at", "2020-07-14 21:58:17.440483"], ["id", 1]]
---
    def create
        @user = User.create(user_params)

        if @user.save