W6D5/NNcats/app/controllers/felines_controller.rb

    def index
        @felines = Feline.all
---
SELECT "felines".* FROM "felines"

    def show
        @feline = Feline.find(params[:id])
---
SELECT  "felines".* FROM "felines" WHERE "felines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
        @feline = Feline.find(params[:id])
---
SELECT  "felines".* FROM "felines" WHERE "felines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        @feline = Feline.find(params[:id])
        if @feline.update(feline_params)
---
SELECT  "felines".* FROM "felines" WHERE "felines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "felines" SET "birth_date" = $1, "updated_at" = $2 WHERE "felines"."id" = $3  [["birth_date", "2020-06-01"], ["updated_at", "2020-07-10 23:05:30.603487"], ["id", 2]]

    def create
        @feline = Feline.new(feline_params)
        if @feline.save
---
INSERT INTO "felines" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"