W7D3/GoalApp/app/controllers/users_controller.rb

    def create
        @user = User.new(params.require(:user).permit(:username, :password))
        if @user.save
---
INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"