W6D4/first_routes_and_controllers /app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        artwork_shares = ArtworkShare.all