W6D4/first_routes_and_controllers /app/controllers/users_controller.rb

 def index
   if params[:query]
      users = User.where('username LIKE ?', params[:query])
      render json: users
   else
      users = User.all
---
SELECT "users".* FROM "users"