W6D3/first_routes_and_controllers/app/controllers/users_controller.rb

 def create
    user = User.new(params.require(:user).permit(:username))
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Jane"], ["email", "jane@gmail.com"], ["created_at", "2020-07-08 23:03:31.308626"], ["updated_at", "2020-07-08 23:03:31.308626"]]